tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1829_tdd.h
#define SSP2CON2_ACKDT                522
#define SSP2CON2_ACKSTAT              523
#define SSP2CON2_GCEN                 524
#define SSP2CON3                      525
#define SSP2CON3_DHEN                 526
#define SSP2CON3_AHEN                 527
#define SSP2CON3_SBCDE                528
#define SSP2CON3_SDAHT                529
#define SSP2CON3_BOEN                 530
#define SSP2CON3_SCIE                 531
#define SSP2CON3_PCIE                 532
#define SSP2CON3_ACKTIM               533
#define CCPR1L                        534
#define CCPR1H                        535
#define CCP1CON                       536
#define CCP1M0                        537
#define CCP1M                         538
#define CCP1M1                        539
#define CCP1M2                        540
#define CCP1M3                        541
#define DC1B                          542
#define DC1B0                         543
#define DC1B1                         544
#define P1M                           545
#define P1M0                          546
#define P1M1                          547
#define PWM1CON                       548
#define P1DC                          549
#define P1DC0                         550
#define P1DC1                         551
#define P1DC2                         552
#define P1DC3                         553
#define P1DC4                         554
#define P1DC5                         555
#define P1DC6                         556
#define P1RSEN                        557
#define PSS1BD                        558
#define PSS1BD0                       559
#define PSS1BD1                       560
#define PSS1AC                        561
#define PSS1AC0                       562
#define PSS1AC1                       563
#define CCP1AS                        564
#define CCP1AS0                       565
#define CCP1AS1                       566
#define CCP1AS2                       567
#define CCP1ASE                       568
#define PSTR1CON                      569
#define STR1A                         570
#define STR1B                         571
#define STR1C                         572
#define STR1D                         573
#define STR1SYNC                      574
#define CCPR2L                        575
#define CCPR2H                        576
#define CCP2CON                       577
#define CCP2M                         578
#define CCP2M0                        579
#define CCP2M1                        580
#define CCP2M2                        581
#define CCP2M3                        582
#define DC2B                          583
#define DC2B0                         584
#define DC2B1                         585
#define P2M                           586
#define P2M0                          587
#define P2M1                          588
#define PWM2CON                       589
#define P2DC                          590
#define P2DC0                         591
#define P2DC1                         592
#define P2DC2                         593
#define P2DC3                         594
#define P2DC4                         595
#define P2DC5                         596
#define P2DC6                         597
#define P2RSEN                        598
#define PSS2BD                        599
#define PSS2BD0                       600
#define PSS2BD1                       601
#define PSS2AC0                       602
#define PSS2AC                        603
#define PSS2AC1                       604
#define CCP2AS0                       605
#define CCP2AS                        606
#define CCP2AS1                       607
#define CCP2AS2                       608
#define CCP2ASE                       609
#define PSTR2CON                      610
#define STR2A                         611
#define STR2B                         612
#define STR2C                         613
#define STR2D                         614
#define STR2SYNC                      615
#define CCPTMRS                       616
#define C1TSEL0                       617
#define C1TSEL                        618
#define C1TSEL1                       619
#define C2TSEL0                       620
#define C2TSEL                        621
#define C2TSEL1                       622
#define C3TSEL0                       623
#define C3TSEL                        624
#define C3TSEL1                       625
#define C4TSEL                        626
#define C4TSEL0                       627
#define C4TSEL1                       628
#define CCPR3L                        629
#define CCPR3H                        630
#define CCP3CON                       631
#define CCP3M                         632
#define CCP3M0                        633
#define CCP3M1                        634
#define CCP3M2                        635
#define CCP3M3                        636
#define DC3B                          637
#define DC3B0                         638
#define DC3B1                         639
#define CCPR4L                        640
#define CCPR4H                        641
#define CCP4CON                       642
#define CCP4M                         643
#define CCP4M0                        644
#define CCP4M1                        645
#define CCP4M2                        646
#define CCP4M3                        647
#define DC4B0                         648
#define DC4B                          649
#define DC4B1                         650
#define INLVLA                        651
#define INLVLA0                       652
#define INLVLA1                       653
#define INLVLA2                       654
#define INLVLA3                       655
#define INLVLA4                       656
#define INLVLA5                       657
#define INLVLB4                       658
#define INLVLB                        659
#define INLVLB5                       660
#define INLVLB6                       661
#define INLVLB7                       662
#define INLVLC                        663
#define INLVLC0                       664
#define INLVLC1                       665
#define INLVLC2                       666
#define INLVLC3                       667
#define INLVLC4                       668
#define INLVLC5                       669
#define INLVLC6                       670
#define INLVLC7                       671
#define IOCAP                         672
#define IOCAP0                        673
#define IOCAP1                        674
#define IOCAP2                        675
#define IOCAP3                        676
#define IOCAP4                        677
#define IOCAP5                        678
#define IOCAN0                        679
#define IOCAN                         680
#define IOCAN1                        681
#define IOCAN2                        682
#define IOCAN3                        683
#define IOCAN4                        684
#define IOCAN5                        685
#define IOCAF0                        686
#define IOCAF                         687
#define IOCAF1                        688
#define IOCAF2                        689
#define IOCAF3                        690
#define IOCAF4                        691
#define IOCAF5                        692
#define IOCBP                         693
#define IOCBP4                        694
#define IOCBP5                        695
#define IOCBP6                        696
#define IOCBP7                        697
#define IOCBN4                        698
#define IOCBN                         699
#define IOCBN5                        700
#define IOCBN6                        701
#define IOCBN7                        702
#define IOCBF4                        703
#define IOCBF                         704
#define IOCBF5                        705
#define IOCBF6                        706
#define IOCBF7                        707
#define CLKRCON                       708
#define CLKRDIV                       709
#define CLKRDIV0                      710
#define CLKRDIV1                      711
#define CLKRDIV2                      712
#define CLKRDC                        713
#define CLKRDC0                       714
#define CLKRDC1                       715
#define CLKRSLR                       716
#define CLKROE                        717
#define CLKREN                        718
#define MDCON                         719
#define MDBIT                         720
#define MDOUT                         721
#define MDOPOL                        722
#define MDSLR                         723
#define MDOE                          724
#define MDEN                          725
#define MDSRC                         726
#define MDMS0                         727
#define MDMS                          728
#define MDMS1                         729
#define MDMS2                         730
#define MDMS3                         731
#define MDMSODIS                      732
#define MDCARL                        733
#define MDCL0                         734
#define MDCL                          735
#define MDCL1                         736
#define MDCL2                         737
#define MDCL3                         738
#define MDCLSYNC                      739
#define MDCLPOL                       740
#define MDCLODIS                      741
#define MDCARH                        742
#define MDCH                          743
#define MDCH0                         744
#define MDCH1                         745
#define MDCH2                         746
#define MDCH3                         747
#define MDCHSYNC                      748
#define MDCHPOL                       749
#define MDCHODIS                      750
#define TMR4                          751
#define PR4                           752
#define T4CON                         753
#define T4CKPS0                       754
#define T4CKPS                        755
#define T4CKPS1                       756
#define TMR4ON                        757
#define T4OUTPS                       758
#define T4OUTPS0                      759
#define T4OUTPS1                      760
#define T4OUTPS2                      761
#define T4OUTPS3                      762
#define TMR6                          763
#define PR6                           764
#define T6CON                         765
#define T6CKPS0                       766
#define T6CKPS                        767
#define T6CKPS1                       768
#define TMR6ON                        769
#define T6OUTPS0                      770
#define T6OUTPS                       771
#define T6OUTPS1                      772
#define T6OUTPS2                      773
#define T6OUTPS3                      774
#define STATUS_SHAD                   775
#define C_SHAD                        776
#define DC_SHAD                       777
#define Z_SHAD                        778
#define WREG_SHAD                     779
#define BSR_SHAD                      780
#define PCLATH_SHAD                   781
#define FSR0L_SHAD                    782
#define FSR0H_SHAD                    783
#define FSR1L_SHAD                    784
#define FSR1H_SHAD                    785
#define STKPTR                        786
#define TOSL                          787
#define TOSH                          788

#endif // _PIC16LF1829_H_
